package Annotacii;

public class AnnotationAbout {// Java аннотации - специальный тип комментариев для компилятора, анализатора исходного кода или фреймворков.
    // Передавать метаданные для рефлексии. Метаданные - данные о данных приложения.
    // Могут быть аннотированы класс, метод, параметр метода, поле и т.д. Override, Deprecated, SupressWarnings.
    // Override - не даст скомпилировать программу без переопределения метода родителя.
    // Deprecated - метод устарел. Не запрещает использование.
    // SupressWarnings - подавлять предупреждения.

}
